responseTemplates_old/DepositMain.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <SOAP-ENV:Header>
        <gbo:UCBRUHeaders xmlns:gbo="urn:ucbru:gbo:v5">
            <gbo:Audit>
                <gbo:MessagePath>
                    <gbo:Step>
                        <gbo:Application.Module>SPDEPDeposListQuery.RequestHandler</gbo:Application.Module>
                        <gbo:VersionId>5</gbo:VersionId>
                        <gbo:TimeStamp>${generate.dateNow}</gbo:TimeStamp>
                        <gbo:RoutingRole>START</gbo:RoutingRole>
                        <gbo:Comment></gbo:Comment>
                    </gbo:Step>
                    <gbo:Step>
                        <gbo:Application.Module>SPDEPDeposListQuery.RequestHandler</gbo:Application.Module>
                        <gbo:VersionId>5</gbo:VersionId>
                        <gbo:TimeStamp>${generate.dateNow}</gbo:TimeStamp>
                        <gbo:RoutingRole>SUCCESS</gbo:RoutingRole>
                        <gbo:Comment></gbo:Comment>
                    </gbo:Step>
                </gbo:MessagePath>
            </gbo:Audit>
        </gbo:UCBRUHeaders>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <spdep:SPDEPDepositList xmlns:spdep="urn:ucbru:gbo:v5:spdep">
            <spdep:DepositList>
                <spdep:CustomerNo>${receive.id}</spdep:CustomerNo>
                <spdep:Deposit>
                    <spdep:DealRef>${receive.id}RURVTDC04O</spdep:DealRef>
                    <spdep:DealRefRus>${receive.id}RURVTDC04O</spdep:DealRefRus>
                    <spdep:Name>Classic deposit plus</spdep:Name>
                    <spdep:AccountNo>${AccountList.account1}</spdep:AccountNo>
                    <spdep:Principal>3088658.68</spdep:Principal>
                    <spdep:Ccy>RUR</spdep:Ccy>
                    <spdep:InterestRate>5.3</spdep:InterestRate>
                    <spdep:Dates>
                        <spdep:DealDate>2021-08-11</spdep:DealDate>
                        <spdep:MaturityDate>2022-05-11</spdep:MaturityDate>
                        <spdep:DepositTenorDay>271</spdep:DepositTenorDay>
                        <spdep:RealDepoTenorDay>273</spdep:RealDepoTenorDay>
                        <spdep:NextAccrualDate>2022-03-31</spdep:NextAccrualDate>
                    </spdep:Dates>
                    <spdep:Status>O</spdep:Status>
                    <spdep:Options>
                        <spdep:Withdrawal>N</spdep:Withdrawal>
                        <spdep:Replenishment>N</spdep:Replenishment>
                        <spdep:AutoRollover>N</spdep:AutoRollover>
                        <spdep:EarlyMaturityAllow>Y</spdep:EarlyMaturityAllow>
                        <spdep:CloseOnMaturity>Y</spdep:CloseOnMaturity>
                    </spdep:Options>
                </spdep:Deposit>
                <spdep:Deposit>
                    <spdep:DealRef>${receive.id}USDPRIM204</spdep:DealRef>
                    <spdep:DealRefRus>${receive.id}USDPRIM204</spdep:DealRefRus>
                    <spdep:Name>
Deposit PRIME</spdep:Name>
                    <spdep:AccountNo>${AccountList.account12}</spdep:AccountNo>
                    <spdep:Principal>200000</spdep:Principal>
                    <spdep:Ccy>USD</spdep:Ccy>
                    <spdep:InterestRate>6</spdep:InterestRate>
                    <spdep:Dates>
                        <spdep:DealDate>2022-03-14</spdep:DealDate>
                        <spdep:MaturityDate>2022-04-14</spdep:MaturityDate>
                        <spdep:DepositTenorDay>31</spdep:DepositTenorDay>
                        <spdep:RealDepoTenorDay>31</spdep:RealDepoTenorDay>
                        <spdep:NextAccrualDate>2022-03-31</spdep:NextAccrualDate>
                    </spdep:Dates>
                    <spdep:Status>O</spdep:Status>
                    <spdep:Options>
                        <spdep:Withdrawal>N</spdep:Withdrawal>
                        <spdep:Replenishment>N</spdep:Replenishment>
                        <spdep:AutoRollover>N</spdep:AutoRollover>
                        <spdep:EarlyMaturityAllow>Y</spdep:EarlyMaturityAllow>
                        <spdep:CloseOnMaturity>Y</spdep:CloseOnMaturity>
                    </spdep:Options>
                </spdep:Deposit>
            </spdep:DepositList>
        </spdep:SPDEPDepositList>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>